{
  "Baseline_Rules": "Game Setup: 8000 Life Points, 5 starting hand cards. Field zones: 5 Monster Zones, 5 Spell/Trap Zones, 1 Field Zone, 1 Extra Deck Zone, 1 Graveyard Zone, 1 Banished Zone. Turn Structure: Draw Phase (draw 1 card, except for the player going first), Standby Phase, Main Phase 1 (Normal Summon/Set, activate Spells/Traps, change battle positions), Battle Phase (conduct attacks), Main Phase 2 (Normal Summon/Set if not done in MP1, activate Spells/Traps, change battle positions if not done in MP1), End Phase. Basic Card Types & Usage: Normal/Effect Monsters (summon, attack, defense), Spells (Normal, Quick-Play, Continuous, Equip, Field, Ritual - activated from hand/field during main phases, Quick-Play can be activated during Battle Phase or chained), Traps (Normal, Continuous, Counter - activated from field, can be chained, Counter Traps are Spell Speed 3). Basic Summoning: Normal Summon/Set (1 per turn, requires no Tribute for Level 4 or lower, 1 Tribute for Level 5-6, 2 Tributes for Level 7+), Tribute Summon, Special Summoning (by card effects, no limit per turn). Chain Mechanics: Spell Speeds 1 (Ignition, Normal Spell/Trap), 2 (Quick-Play Spell, Quick Effect, Normal Trap, Continuous Spell/Trap, Equip/Field Spell activation), 3 (Counter Trap). Chains resolve Last In First Out. Basic Interactions: Battle destruction (monster ATK vs. DEF/ATK), targeting (select specific card), negation (prevent activation/effect).",
  "Goat_Format": "Based on the 2005 April 1st Forbidden & Limited List. Player going first draws a card in their first Draw Phase, resulting in a 6-card starting hand. No Synchro, Xyz, Pendulum, or Link Monsters exist. Fusion Summoning requires 'Polymerization' or similar effects. Certain timing rules, particularly in the Damage Step, have specific interpretations where effects that activate 'at the start of the Damage Step' or 'before damage calculation' have distinct substeps and priorities for activation. Continuous Spell/Trap Cards must remain face-up on the field to resolve their effects.",
  "Edison_Format": "Based on the 2010 April 1st TCG Forbidden & Limited List. Synchro Summoning is the primary Extra Deck mechanic. No Xyz, Pendulum, or Link Monsters exist. Synchro Monsters are summoned from the Extra Deck by sending 1 Tuner monster and 1 or more non-Tuner monsters from the field to the Graveyard whose combined Levels equal the Synchro Monster's Level. Continuous effects of monsters flipped face-up in the Damage Step become active before damage calculation. Hand traps like 'Effect Veiler' and 'D.D. Crow' are prominent and can be activated during either player's turn to disrupt plays.",
  "Tengu_Plant_Format": "Based on the 2011 September TCG Forbidden & Limited List. Introduces Xyz Summoning but Synchro Summoning remains dominant. Xyz Monsters are summoned from the Extra Deck by overlaying 2 or more monsters of the same Level (their Xyz Materials). Xyz Monsters do not have Levels while on the field or in the Graveyard. Some cards gain effects when sent from the field to the Graveyard regardless of how they were sent (e.g., 'Reborn Tengu'), which is a significant aspect of the format's strategy. Hand traps like 'Effect Veiler' and 'Maxx \"C\"' become more prevalent.",
  "Dragon_Ruler_Format": "Based on the 2013 September TCG Forbidden & Limited List. Emphasizes self-Special Summoning monsters (Dragon Rulers) from hand or Graveyard by banishing specific monster types/Attributes. These monsters also have effects when discarded or banished, allowing for extensive resource cycling and card advantage. Xyz Summoning, particularly of Rank 7 monsters, is a central mechanic due to the high Levels of the Dragon Rulers. The format heavily features powerful draw spells that capitalize on discarding/banishing monsters.",
  "HAT_Format": "Based on the 2014 April TCG Forbidden & Limited List. Stands for Hands, Artifacts, and Traptrix, indicating the prominent archetypes. This format sees a shift towards slower, grindier duels with a focus on resource management and disruptive Trap Cards. Artifact monsters have unique Quick Effects that allow them to be Special Summoned from the hand during the opponent's turn if a Spell/Trap they control is destroyed. Hand monsters (Ice Hand, Fire Hand) have effects that activate when destroyed by battle or card effect, replacing themselves and often destroying an opponent's card.",
  "Nekroz_Format": "Based on the 2015 March TCG Forbidden & Limited List. Features a strong Ritual Summoning archetype, 'Nekroz', which can Ritual Summon monsters from the hand by sending monsters from hand or field to the Graveyard whose total Levels are equal to or greater than the Ritual Monster's Level. Nekroz Ritual Spells often have secondary effects from the Graveyard, and Nekroz monsters have effects that activate when discarded from the hand, allowing for extensive searching and recovery. The format is characterized by high consistency and powerful negation effects from Extra Deck monsters.",
  "PePe_Format": "Based on the 2016 January TCG Forbidden & Limited List. Introduces Pendulum Summoning as a new mechanic, which allows players to Special Summon multiple monsters from their hand and/or face-up from their Extra Deck simultaneously. Pendulum Monsters exist as both monsters and Spell Cards, placed in dedicated Pendulum Zones (which originally were part of the Spell/Trap Zones). If a Pendulum Monster would be sent from the field to the Graveyard, it is placed face-up in the Extra Deck instead. The format is known for its explosive combo potential and ability to spam Xyz Monsters (especially Rank 4s) and Synchro Monsters.",
  "Zoodiac_Format": "Based on the 2017 March TCG Forbidden & Limited List. Focuses on the 'Zoodiac' archetype, which can Xyz Summon monsters using only 1 monster as material. Zoodiac Xyz Monsters gain effects based on the number of Zoodiac monsters attached as Xyz Material. This leads to incredibly efficient and compact Extra Deck plays, enabling quick access to powerful Xyz effects and setting up aggressive boards with minimal commitment. This format is characterized by high-speed duels and a heavy reliance on a small number of core engine cards.",
  "Advanced_Format": "This is the current official TCG/OCG format and is constantly evolving. It incorporates all previously introduced summoning mechanics (Fusion, Ritual, Synchro, Xyz, Pendulum, Link Summoning). A major rule revision, Master Rule 4 (Link Summoning), introduced Extra Monster Zones, restricting Extra Deck Special Summons (Fusion, Synchro, Xyz) to either an Extra Monster Zone or a Main Monster Zone that a Link Monster points to. Pendulum Monsters summoned from the Extra Deck are also restricted to these zones. Link Monsters are summoned by sending monsters from the field to the Graveyard equal to their Link Rating, and have Link Arrows that point to other zones, enabling further Extra Deck Special Summons. Master Rule 5 (current as of early 2020) relaxed some of these restrictions, allowing Fusion, Synchro, and Xyz Monsters to be Special Summoned to any Main Monster Zone without needing a Link Monster, while Pendulum and Link Monsters still require an Extra Monster Zone or Link Arrow. The format has a regularly updated Forbidden & Limited List, impacting card pool and strategic viability. Timing rules for card activations generally follow the current Master Rules, emphasizing 'When... you can' and 'If... you can' triggers and the 'Fast Effect Timing Chart' to determine when quick effects can be activated."
}